2023/ycsb/mongodb/dbaas-navigator_ycsb_mongodb-documentdb-aws_0_oZXaAHkr/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-70a2887c-263f-5eaf-b71f-c7d4a5a65d6f.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-70a2887c-263f-5eaf-b71f-c7d4a5a65d6f.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-70a2887c-263f-5eaf-b71f-c7d4a5a65d6f.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-01-09 09:08:57:172 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://root:pCm9YZpSAres@dbaas-navigator-70a2887c-263f-5eaf-b71f-c7d4a5a65d6f.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2023-01-09 09:09:07:156 10 sec: 175200 operations; 17520 current ops/sec; est completion in 9 minutes [INSERT: Count=175200, Max=2164735, Min=6, Avg=5271.55, 90=14, 99=11607, 99.9=1097727, 99.99=1734655] 
2023-01-09 09:09:17:156 20 sec: 359600 operations; 18440 current ops/sec; est completion in 8 minutes [INSERT: Count=184400, Max=2035711, Min=6, Avg=5429.37, 90=12, 99=16151, 99.9=1089535, 99.99=1603583] 
2023-01-09 09:09:27:156 30 sec: 543800 operations; 18420 current ops/sec; est completion in 8 minutes [INSERT: Count=184200, Max=1963007, Min=6, Avg=5406.16, 90=9, 99=8783, 99.9=1082367, 99.99=1590271] 
2023-01-09 09:09:37:156 40 sec: 729500 operations; 18570 current ops/sec; est completion in 8 minutes [INSERT: Count=185700, Max=2277375, Min=6, Avg=5446.16, 90=10, 99=6707, 99.9=1116159, 99.99=1581055] 
2023-01-09 09:09:47:156 50 sec: 913800 operations; 18430 current ops/sec; est completion in 8 minutes [INSERT: Count=184300, Max=1862655, Min=6, Avg=5387.3, 90=8, 99=6295, 99.9=1054719, 99.99=1582079] 
2023-01-09 09:09:57:156 60 sec: 1100600 operations; 18680 current ops/sec; est completion in 8 minutes [INSERT: Count=186800, Max=2084863, Min=6, Avg=5338.83, 90=9, 99=6195, 99.9=1058815, 99.99=1639423] 
2023-01-09 09:10:07:156 70 sec: 1284500 operations; 18390 current ops/sec; est completion in 7 minutes [INSERT: Count=183900, Max=2162687, Min=6, Avg=5434.7, 90=9, 99=5719, 99.9=1089535, 99.99=1590271] 
2023-01-09 09:10:17:156 80 sec: 1468200 operations; 18370 current ops/sec; est completion in 7 minutes [INSERT: Count=183700, Max=1940479, Min=6, Avg=5466.46, 90=8, 99=6451, 99.9=1090559, 99.99=1674239] 
2023-01-09 09:10:27:156 90 sec: 1654300 operations; 18610 current ops/sec; est completion in 7 minutes [INSERT: Count=186100, Max=1991679, Min=6, Avg=5376.05, 90=9, 99=11167, 99.9=1105919, 99.99=1610751] 
2023-01-09 09:10:37:156 100 sec: 1839100 operations; 18480 current ops/sec; est completion in 7 minutes [INSERT: Count=184800, Max=1976319, Min=6, Avg=5398.08, 90=9, 99=18991, 99.9=1064959, 99.99=1561599] 
2023-01-09 09:10:47:156 110 sec: 2023600 operations; 18450 current ops/sec; est completion in 7 minutes [INSERT: Count=184500, Max=2109439, Min=6, Avg=5433.52, 90=8, 99=21903, 99.9=1075199, 99.99=1594367] 
2023-01-09 09:10:57:156 120 sec: 2209500 operations; 18590 current ops/sec; est completion in 7 minutes [INSERT: Count=185900, Max=2091007, Min=6, Avg=5362.29, 90=8, 99=7887, 99.9=1071103, 99.99=1514495] 
2023-01-09 09:11:07:156 130 sec: 2394386 operations; 18488.6 current ops/sec; est completion in 6 minutes [INSERT: Count=184900, Max=2506751, Min=6, Avg=5417.09, 90=8, 99=7527, 99.9=1065983, 99.99=1576959] 
2023-01-09 09:11:17:156 140 sec: 2579258 operations; 18487.2 current ops/sec; est completion in 6 minutes [INSERT: Count=184882, Max=2316287, Min=6, Avg=5409.36, 90=8, 99=18415, 99.9=1068031, 99.99=1658879] 
2023-01-09 09:11:27:156 150 sec: 2765200 operations; 18594.2 current ops/sec; est completion in 6 minutes [INSERT: Count=185918, Max=2031615, Min=6, Avg=5369.96, 90=8, 99=21311, 99.9=1064959, 99.99=1603583] 
2023-01-09 09:11:37:156 160 sec: 2952800 operations; 18760 current ops/sec; est completion in 6 minutes [INSERT: Count=187600, Max=2269183, Min=6, Avg=5339.6, 90=8, 99=19999, 99.9=1073151, 99.99=1615871] 
2023-01-09 09:11:47:156 170 sec: 3137700 operations; 18490 current ops/sec; est completion in 6 minutes [INSERT: Count=184900, Max=2199551, Min=6, Avg=5398.58, 90=8, 99=5031, 99.9=1069055, 99.99=1579007] 
2023-01-09 09:11:57:156 180 sec: 3325700 operations; 18800 current ops/sec; est completion in 6 minutes [INSERT: Count=188000, Max=2111487, Min=6, Avg=5315.77, 90=8, 99=19551, 99.9=1068031, 99.99=1579007] 
2023-01-09 09:12:07:156 190 sec: 3511700 operations; 18600 current ops/sec; est completion in 5 minutes [INSERT: Count=186000, Max=2328575, Min=6, Avg=5356.5, 90=8, 99=20239, 99.9=1094655, 99.99=1566719] 
2023-01-09 09:12:17:156 200 sec: 3698100 operations; 18640 current ops/sec; est completion in 5 minutes [INSERT: Count=186400, Max=2181119, Min=6, Avg=5382.09, 90=9, 99=21343, 99.9=1060863, 99.99=1655807] 
2023-01-09 09:12:27:156 210 sec: 3884800 operations; 18670 current ops/sec; est completion in 5 minutes [INSERT: Count=186700, Max=2068479, Min=6, Avg=5340.54, 90=9, 99=21375, 99.9=1053695, 99.99=1568767] 
2023-01-09 09:12:37:156 220 sec: 4071100 operations; 18630 current ops/sec; est completion in 5 minutes [INSERT: Count=186300, Max=2232319, Min=6, Avg=5392.33, 90=9, 99=22207, 99.9=1031167, 99.99=1575935] 
2023-01-09 09:12:47:156 230 sec: 4257000 operations; 18590 current ops/sec; est completion in 5 minutes [INSERT: Count=185900, Max=2103295, Min=6, Avg=5368.14, 90=8, 99=21471, 99.9=1072127, 99.99=1549311] 
2023-01-09 09:12:57:156 240 sec: 4444500 operations; 18750 current ops/sec; est completion in 5 minutes [INSERT: Count=187500, Max=2107391, Min=6, Avg=5334.8, 90=8, 99=22079, 99.9=1039359, 99.99=1634303] 
2023-01-09 09:13:07:156 250 sec: 4631100 operations; 18660 current ops/sec; est completion in 4 minutes [INSERT: Count=186600, Max=2254847, Min=6, Avg=5353.63, 90=8, 99=20415, 99.9=1042431, 99.99=1579007] 
2023-01-09 09:13:17:156 260 sec: 4816800 operations; 18570 current ops/sec; est completion in 4 minutes [INSERT: Count=185700, Max=1917951, Min=6, Avg=5372.19, 90=10, 99=17855, 99.9=1039359, 99.99=1551359] 
2023-01-09 09:13:27:156 270 sec: 5004600 operations; 18780 current ops/sec; est completion in 4 minutes [INSERT: Count=187800, Max=2045951, Min=6, Avg=5332.92, 90=10, 99=20159, 99.9=1047039, 99.99=1648639] 
2023-01-09 09:13:37:156 280 sec: 5193379 operations; 18877.9 current ops/sec; est completion in 4 minutes [INSERT: Count=188800, Max=1893375, Min=6, Avg=5277.4, 90=10, 99=5131, 99.9=1016319, 99.99=1524735] 
2023-01-09 09:13:47:156 290 sec: 5380400 operations; 18702.1 current ops/sec; est completion in 4 minutes [INSERT: Count=187000, Max=2060287, Min=6, Avg=5374.2, 90=8, 99=18079, 99.9=1041919, 99.99=1564671] 
2023-01-09 09:13:57:156 300 sec: 5537200 operations; 15680 current ops/sec; est completion in 4 minutes [INSERT: Count=156841, Max=3561471, Min=6, Avg=6355.14, 90=8, 99=21647, 99.9=1287167, 99.99=2813951] 
2023-01-09 09:14:07:156 310 sec: 5724600 operations; 18740 current ops/sec; est completion in 3 minutes [INSERT: Count=187359, Max=2113535, Min=6, Avg=5354.34, 90=8, 99=5559, 99.9=1069055, 99.99=1571839] 
2023-01-09 09:14:17:156 320 sec: 5911000 operations; 18640 current ops/sec; est completion in 3 minutes [INSERT: Count=186400, Max=1956863, Min=6, Avg=5357.6, 90=10, 99=22239, 99.9=1043967, 99.99=1563647] 
2023-01-09 09:14:27:156 330 sec: 6098900 operations; 18790 current ops/sec; est completion in 3 minutes [INSERT: Count=187900, Max=2021375, Min=6, Avg=5314.28, 90=8, 99=19855, 99.9=1060863, 99.99=1565695] 
2023-01-09 09:14:37:156 340 sec: 6287600 operations; 18870 current ops/sec; est completion in 3 minutes [INSERT: Count=188700, Max=2011135, Min=6, Avg=5312.94, 90=10, 99=22143, 99.9=1021439, 99.99=1552383] 
2023-01-09 09:14:47:156 350 sec: 6473900 operations; 18630 current ops/sec; est completion in 3 minutes [INSERT: Count=186300, Max=2347007, Min=6, Avg=5367.82, 90=9, 99=19919, 99.9=1046015, 99.99=1656831] 
2023-01-09 09:14:57:156 360 sec: 6662600 operations; 18870 current ops/sec; est completion in 3 minutes [INSERT: Count=188700, Max=2189311, Min=6, Avg=5313.7, 90=9, 99=20415, 99.9=1051647, 99.99=1587199] 
2023-01-09 09:15:07:156 370 sec: 6849245 operations; 18664.5 current ops/sec; est completion in 2 minutes [INSERT: Count=186678, Max=2351103, Min=6, Avg=5340.55, 90=9, 99=20079, 99.9=1059839, 99.99=1647615] 
2023-01-09 09:15:17:156 380 sec: 7032900 operations; 18365.5 current ops/sec; est completion in 2 minutes [INSERT: Count=183622, Max=2156543, Min=6, Avg=5420.65, 90=9, 99=20239, 99.9=1061887, 99.99=1538047] 
2023-01-09 09:15:27:156 390 sec: 7221100 operations; 18820 current ops/sec; est completion in 2 minutes [INSERT: Count=188200, Max=2063359, Min=6, Avg=5324.21, 90=10, 99=20671, 99.9=1030655, 99.99=1568767] 
2023-01-09 09:15:37:156 400 sec: 7411000 operations; 18990 current ops/sec; est completion in 2 minutes [INSERT: Count=189900, Max=2277375, Min=6, Avg=5280.61, 90=10, 99=21663, 99.9=1062911, 99.99=1635327] 
2023-01-09 09:15:47:156 410 sec: 7596500 operations; 18550 current ops/sec; est completion in 2 minutes [INSERT: Count=185500, Max=2496511, Min=6, Avg=5352.77, 90=11, 99=20191, 99.9=1082367, 99.99=1660927] 
2023-01-09 09:15:57:156 420 sec: 7784300 operations; 18780 current ops/sec; est completion in 2 minutes [INSERT: Count=187800, Max=2006015, Min=6, Avg=5338.58, 90=9, 99=5319, 99.9=1041919, 99.99=1524735] 
2023-01-09 09:16:07:156 430 sec: 7971100 operations; 18680 current ops/sec; est completion in 1 minute [INSERT: Count=186800, Max=2109439, Min=6, Avg=5332.34, 90=8, 99=21135, 99.9=1051647, 99.99=1557503] 
2023-01-09 09:16:17:156 440 sec: 8156400 operations; 18530 current ops/sec; est completion in 1 minute [INSERT: Count=185300, Max=2553855, Min=6, Avg=5403.86, 90=10, 99=19631, 99.9=1110015, 99.99=1704959] 
2023-01-09 09:16:27:156 450 sec: 8343400 operations; 18700 current ops/sec; est completion in 1 minute [INSERT: Count=187000, Max=2140159, Min=6, Avg=5368.51, 90=9, 99=5343, 99.9=1086463, 99.99=1642495] 
2023-01-09 09:16:37:156 460 sec: 8529900 operations; 18650 current ops/sec; est completion in 1 minute [INSERT: Count=186500, Max=1940479, Min=6, Avg=5339.7, 90=9, 99=18783, 99.9=1091583, 99.99=1634303] 
2023-01-09 09:16:47:156 470 sec: 8716600 operations; 18670 current ops/sec; est completion in 1 minute [INSERT: Count=186700, Max=2353151, Min=6, Avg=5358.64, 90=9, 99=19311, 99.9=1033215, 99.99=1543167] 
2023-01-09 09:16:57:156 480 sec: 8905000 operations; 18840 current ops/sec; est completion in 1 minute [INSERT: Count=188400, Max=2387967, Min=6, Avg=5314.72, 90=10, 99=21199, 99.9=1028607, 99.99=1492991] 
2023-01-09 09:17:07:156 490 sec: 9091400 operations; 18640 current ops/sec; est completion in 49 seconds [INSERT: Count=186400, Max=1995775, Min=6, Avg=5370.67, 90=11, 99=6055, 99.9=1067007, 99.99=1582079] 
2023-01-09 09:17:17:156 500 sec: 9276000 operations; 18460 current ops/sec; est completion in 40 seconds [INSERT: Count=184600, Max=2277375, Min=6, Avg=5396.14, 90=11, 99=19695, 99.9=1049599, 99.99=1595391] 
2023-01-09 09:17:27:156 510 sec: 9461801 operations; 18580.1 current ops/sec; est completion in 30 seconds [CLEANUP: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] [INSERT: Count=185801, Max=2195455, Min=6, Avg=5389.78, 90=10, 99=18959, 99.9=1088511, 99.99=1600511] 
2023-01-09 09:17:37:156 520 sec: 9648408 operations; 18660.7 current ops/sec; est completion in 19 seconds [CLEANUP: Count=7, Max=2, Min=1, Avg=1.14, 90=1, 99=2, 99.9=2, 99.99=2] [INSERT: Count=186607, Max=2111487, Min=6, Avg=5162.11, 90=9, 99=22447, 99.9=1041407, 99.99=1513471] 
2023-01-09 09:17:47:156 530 sec: 9832630 operations; 18422.2 current ops/sec; est completion in 10 seconds [CLEANUP: Count=22, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [INSERT: Count=184222, Max=1958911, Min=6, Avg=4704.19, 90=11, 99=25183, 99.9=903679, 99.99=1385471] 
2023-01-09 09:17:56:721 539 sec: 10000000 operations; 17500 current ops/sec; [CLEANUP: Count=70, Max=4883, Min=0, Avg=70.3, 90=1, 99=2, 99.9=4883, 99.99=4883] [INSERT: Count=167370, Max=1637375, Min=6, Avg=2553.73, 90=10, 99=29199, 99.9=542719, 99.99=895487] 
[OVERALL], RunTime(ms), 539564
[OVERALL], Throughput(ops/sec), 18533.482589646454
[TOTAL_GCS_PS_Scavenge], Count, 703
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3197
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5925154383909972
[TOTAL_GCS_PS_MarkSweep], Count, 52
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 1146
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.2123937104773484
[TOTAL_GCs], Count, 755
[TOTAL_GC_TIME], Time(ms), 4343
[TOTAL_GC_TIME_%], Time(%), 0.8049091488683456
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 49.57
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4883
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 6
[INSERT], Operations, 10000000
[INSERT], AverageLatency(us), 5317.1298353
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 3561471
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 19887
[INSERT], Return=OK, 100000
[INSERT], Return=BATCHED_OK, 9900000